// Устанавливает статус "Закрыт" заказа поставщику.
//
Процедура УстановитьСтатусЗаказаПоставщикуЗакрыт(ЗначениеСтатуса)
	
	Если ЗначениеЗаполнено(ЗаказПоставщику) И НЕ ЗаказПоставщику.Закрыт = ЗначениеСтатуса Тогда
		//+КХ
		ЗаказПоставщикуОбъект = ЗаказПоставщику.ПолучитьОбъект();
		ЗаказПоставщикуОбъект.Закрыт = ЗначениеСтатуса;
		Если ЗаказПоставщику.Проведен Тогда
			ЗаказПоставщикуОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ЗаказПоставщикуОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;//-КХ
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьОтображениеИндексыСПАРК()
        //+КХ Пашков_TEST +  Крюгер 02.063.2018  
	ПараметрыОтображения = Новый Структура("ВариантОтображения", "Однострочный");
	//-КХ
	СПАРКРискиКлиент.ОтобразитьИндексыСПАРК(
		ЭтотОбъект.ИндексыСПАРКРиски,
		Неопределено,
		Объект.Контрагент, // Искать по ссылке
		ЭтотОбъект,
		ПараметрыОтображения,
		Истина);

КонецПроцедуры

//+КХ Пашков_ГТД +  Крюгер 13.03.2018  
&НаКлиенте
Процедура ТоварыкрюНомерГТДПриИзменении(Элемент)
	Если НЕ РедактированиеГТД Тогда 
		ТоварыкрюНомерГТДПриИзмененииНаСервере();
		РедактированиеГТД  = Истина;
	КонецЕсли;
КонецПроцедуры
// Не попадает в планы обмена, что бы не регистрировать, добавляем точку в комментарий
&НаСервере
Процедура ТоварыкрюНомерГТДПриИзмененииНаСервере()
	текКомментарий     = СокрЛП(Объект.Комментарий);
	Объект.Комментарий = ?(Прав(текКомментарий,1) = ".",Лев(текКомментарий,СтрДлина(текКомментарий)-1),текКомментарий + ".");
КонецПроцедуры
// Пашков_ГТД -  Крюгер 13.03.2018 -КХ

#КонецОбласти

#КонецОбласти
